![СамГТУ]("СамГТУ") 
<p style = 'text-align: center'>
МИНИСТЕРСТВО ОБРАЗОВАНИЯ И НАУКИ РОССИЙСКОЙ ФЕДЕРАЦИИ<br>
Федеральное государственное бюджетное образовательное учреждение высшего образования<br>
«Самарский государственный технический университет»<br>
(ФГБОУ ВО «СамГТУ»)<br>
Институт автоматики и информационных технологий<br>
Кафедра "Вычислительная техника"</p><br><br><br><br><br><br>
<h3 style = 'text-align: center'> Отчёт о выполнении лабораторной работы №1<br></h3>
<h3 style = 'text-align: center'> По дисциплине "Анализ больших данных"<br></h3>
<h3 style = 'text-align: center'> На тему "Введение в BigData"<br></h3><br><br><br><br><br><br>
<p style = 'text-align: right'>
Проверил: профессор, д.т.н. Гавлиевский С. Л.<br><br>
Выполнили: студенты 2-ИАИТ-21ИАИТ-103М<br>
Павлов А. С.<br>
Рындина М. С.<br>
Баранов А. С.<br>
Емелина А. А.<br><br><br>
</p>
<p style = 'text-align: center'>
Самара 2022<br><br><br>
</p>

## 1. Структурированные списки

### 1.1. Структурированные списки

#### 1.1.1. Создание структурированного списка

In [1]:
#Импорт
import numpy as np
#Создание структурированного списка
info = np.array([(1, 'Tom', 1111, 111111, '89869501111', 'tom@mail.ru', 'Org1', 20000), 
                 (2, 'Bob', 2222, 222222, '89869502222', 'bob@mail.ru', 'Org2', 30000), 
                 (3, 'Katy', 3333, 333333, '89869503333', 'katy@mail.ru', 'Org3', 50000)],
             dtype=[('id', int),
                    ('name', 'U10'),
                    ('passport_series', int),
                    ('passport_number', int),
                    ('phone', 'U11'),
                    ('email', 'U20'),
                    ('workplace', 'U20'),
                    ('salary', float) 
                   ])

#### 1.1.2. Вывод структурированного списка с указанием типа данных

In [2]:
#Вывод списка
info

array([(1, 'Tom', 1111, 111111, '89869501111', 'tom@mail.ru', 'Org1', 20000.),
       (2, 'Bob', 2222, 222222, '89869502222', 'bob@mail.ru', 'Org2', 30000.),
       (3, 'Katy', 3333, 333333, '89869503333', 'katy@mail.ru', 'Org3', 50000.)],
      dtype=[('id', '<i4'), ('name', '<U10'), ('passport_series', '<i4'), ('passport_number', '<i4'), ('phone', '<U11'), ('email', '<U20'), ('workplace', '<U20'), ('salary', '<f8')])

#### 1.1.3. Вывод содержимого структурированного списка

In [3]:
#Вывод содержимого списка
print(info)

[(1, 'Tom', 1111, 111111, '89869501111', 'tom@mail.ru', 'Org1', 20000.)
 (2, 'Bob', 2222, 222222, '89869502222', 'bob@mail.ru', 'Org2', 30000.)
 (3, 'Katy', 3333, 333333, '89869503333', 'katy@mail.ru', 'Org3', 50000.)]

#### 1.1.4. Обращение к элементу структурированного списка по индексу

In [4]:
#Получение элемента
a = info[0]
#Вывод
print(type(a), a)

<class 'numpy.void'> (1, 'Tom', 1111, 111111, '89869501111', 'tom@mail.ru', 'Org1', 20000.)

#### 1.1.5. Обращение к элементам структурированного списка с помощью среза

In [5]:
#Получение элементов по срезу
info[0:2]

array([(1, 'Tom', 1111, 111111, '89869501111', 'tom@mail.ru', 'Org1', 20000.),
       (2, 'Bob', 2222, 222222, '89869502222', 'bob@mail.ru', 'Org2', 30000.)],
      dtype=[('id', '<i4'), ('name', '<U10'), ('passport_series', '<i4'), ('passport_number', '<i4'), ('phone', '<U11'), ('email', '<U20'), ('workplace', '<U20'), ('salary', '<f8')])

#### 1.1.6. Получение значений из структурированного списка по одному полю

In [6]:
#Получение значений по полю
info['email']

array(['tom@mail.ru', 'bob@mail.ru', 'katy@mail.ru'], dtype='<U20')

#### 1.1.7. Получение значений из структурированного списка по двумя полям

In [7]:
#Получение значений по двум полям
info[['name', 'workplace']]

array([('Tom', 'Org1'), ('Bob', 'Org2'), ('Katy', 'Org3')],
      dtype={'names':['name','workplace'], 'formats':['<U10','<U20'], 'offsets':[4,176], 'itemsize':264})

#### 1.1.8. Получение значений для нулевого элемента структурированного списка по двумя полям

In [8]:
#Получение значений для нулевого элемента по двум полям
info[['name', 'workplace']][0]

('Tom', 'Org1')

#### 1.1.9. Получение значений для первого элемента структурированного списка по двумя полям

In [9]:
#Получение значений для первого элемента по двум полям
info[['name', 'workplace']][1]

('Bob', 'Org2')

#### 1.1.10. Изменение элемента структурированного списка

In [10]:
#Изменение элемента
info[2] = (4, 'Mike', 4444, 444444, '89869504444', 'mike@mail.ru', 'Org4', 40000)
#Вывод
info

array([(1, 'Tom', 1111, 111111, '89869501111', 'tom@mail.ru', 'Org1', 20000.),
       (2, 'Bob', 2222, 222222, '89869502222', 'bob@mail.ru', 'Org2', 30000.),
       (4, 'Mike', 4444, 444444, '89869504444', 'mike@mail.ru', 'Org4', 40000.)],
      dtype=[('id', '<i4'), ('name', '<U10'), ('passport_series', '<i4'), ('passport_number', '<i4'), ('phone', '<U11'), ('email', '<U20'), ('workplace', '<U20'), ('salary', '<f8')])

#### 1.1.11. Изменение одного поля элемента структурированного списка

In [11]:
#Изменение поля элемента
info['salary'][0] = 25000
#Вывод
info

array([(1, 'Tom', 1111, 111111, '89869501111', 'tom@mail.ru', 'Org1', 25000.),
       (2, 'Bob', 2222, 222222, '89869502222', 'bob@mail.ru', 'Org2', 30000.),
       (4, 'Mike', 4444, 444444, '89869504444', 'mike@mail.ru', 'Org4', 40000.)],
      dtype=[('id', '<i4'), ('name', '<U10'), ('passport_series', '<i4'), ('passport_number', '<i4'), ('phone', '<U11'), ('email', '<U20'), ('workplace', '<U20'), ('salary', '<f8')])

### 1.2. Чтение / запись списков

#### 1.2.1. Создание структурированного списка

In [12]:
#Импорт
import numpy as np
#Создание структурированного списка
#Создание структурированного списка
info = np.array([(1, 'Tom', 1111, 111111, '89869501111', 'tom@mail.ru', 'Org1', 20000), 
                 (2, 'Bob', 2222, 222222, '89869502222', 'bob@mail.ru', 'Org2', 30000), 
                 (3, 'Katy', 3333, 333333, '89869503333', 'katy@mail.ru', 'Org3', 50000)],
             dtype=[('id', int),
                    ('name', 'U10'),
                    ('passport_series', int),
                    ('passport_number', int),
                    ('phone', 'U11'),
                    ('email', 'U20'),
                    ('workplace', 'U20'),
                    ('salary', float) 
                   ])
#Вывод списка
info

array([(1, 'Tom', 1111, 111111, '89869501111', 'tom@mail.ru', 'Org1', 20000.),
       (2, 'Bob', 2222, 222222, '89869502222', 'bob@mail.ru', 'Org2', 30000.),
       (3, 'Katy', 3333, 333333, '89869503333', 'katy@mail.ru', 'Org3', 50000.)],
      dtype=[('id', '<i4'), ('name', '<U10'), ('passport_series', '<i4'), ('passport_number', '<i4'), ('phone', '<U11'), ('email', '<U20'), ('workplace', '<U20'), ('salary', '<f8')])

#### 1.2.2. Запись структурированного списка в файл формата .npy

In [13]:
#Запись списка в файл info.npy
np.save("info.npy", info)

#### 1.2.3. Чтение структурированного списка из файла формата .npy

In [14]:
#Чтение списка из файла info.npy
np.load("info.npy")

array([(1, 'Tom', 1111, 111111, '89869501111', 'tom@mail.ru', 'Org1', 20000.),
       (2, 'Bob', 2222, 222222, '89869502222', 'bob@mail.ru', 'Org2', 30000.),
       (3, 'Katy', 3333, 333333, '89869503333', 'katy@mail.ru', 'Org3', 50000.)],
      dtype=[('id', '<i4'), ('name', '<U10'), ('passport_series', '<i4'), ('passport_number', '<i4'), ('phone', '<U11'), ('email', '<U20'), ('workplace', '<U20'), ('salary', '<f8')])

#### 1.2.4. Запись массива в файл формата .txt

In [15]:
#Создание массива
salaries = np.array([20000., 30000., 40000., 50000.])
#Запись массива в файл ages.txt
np.savetxt("salaries.txt", salaries)

#### 1.2.5. Чтение массива из файла формата .txt

In [16]:
#Чтение массива из файла ages.txt
np.loadtxt("salaries.txt")

array([20000., 30000., 40000., 50000.])

#### 1.2.6. Преобразование массива в список

In [17]:
#Преобразование в список
info.tolist()

[(1, 'Tom', 1111, 111111, '89869501111', 'tom@mail.ru', 'Org1', 20000.0),
 (2, 'Bob', 2222, 222222, '89869502222', 'bob@mail.ru', 'Org2', 30000.0),
 (3, 'Katy', 3333, 333333, '89869503333', 'katy@mail.ru', 'Org3', 50000.0)]

#### 1.2.7. Преобразование массива в строку

In [18]:
#Преобразование в строку
np.array2string(info)

"[(1, 'Tom', 1111, 111111, '89869501111', 'tom@mail.ru', 'Org1', 20000.)\n (2, 'Bob', 2222, 222222, '89869502222', 'bob@mail.ru', 'Org2', 30000.)\n (3, 'Katy', 3333, 333333, '89869503333', 'katy@mail.ru', 'Org3', 50000.)]"

## 2. Библиотека Pandas

### 2.1. Основные структуры

#### 2.1.1. Создание датафрейма

In [19]:
#Импорт
import pandas as pd
#Создание датафрейма
df = pd.DataFrame([[1, 'Tom', 1111, 111111, '89869501111', 'tom@mail.ru', 'Org1', 20000], 
                   [2, 'Bob', 2222, 222222, '89869502222', 'bob@mail.ru', 'Org2', 25000], 
                   [3, 'Mike', 3333, 333333, '89869503333', 'mike@mail.ru', 'Org3', 30000],
                   [4, 'John', 4444, 444444, '89869504444', 'john@mail.ru', 'Org4', 35000],
                   [5, 'Sam', 5555, 555555, '89869505555', 'sam@mail.ru', 'Org5', 40000],
                   [6, 'Katy', 6666, 666666, '89869506666', 'katy@mail.ru', None, 0]])
#Вывод
df

   0     1     2       3            4             5     6      7
0  1   Tom  1111  111111  89869501111   tom@mail.ru  Org1  20000
1  2   Bob  2222  222222  89869502222   bob@mail.ru  Org2  25000
2  3  Mike  3333  333333  89869503333  mike@mail.ru  Org3  30000
3  4  John  4444  444444  89869504444  john@mail.ru  Org4  35000
4  5   Sam  5555  555555  89869505555   sam@mail.ru  Org5  40000
5  6  Katy  6666  666666  89869506666  katy@mail.ru  None      0

#### 2.1.2. Вывод типа датафрейма

In [20]:
#Вывод типа датафрейма
type(df)

pandas.core.frame.DataFrame

#### 2.1.3. Обращение к столбцу датафрейма

In [21]:
#Обращение к столбцу датафрейма
df[5]

0     tom@mail.ru
1     bob@mail.ru
2    mike@mail.ru
3    john@mail.ru
4     sam@mail.ru
5    katy@mail.ru
Name: 5, dtype: object

### 2.2. Индексы и метод .iloc

#### 2.2.1. Создание датафрейма

In [22]:
#Импорт
import pandas as pd
#Создание датафрейма
df = pd.DataFrame([[1, 'Tom', 1111, 111111, '89869501111', 'tom@mail.ru', 'Org1', 20000], 
                   [2, 'Bob', 2222, 222222, '89869502222', 'bob@mail.ru', 'Org2', 25000], 
                   [3, 'Mike', 3333, 333333, '89869503333', 'mike@mail.ru', 'Org3', 30000],
                   [4, 'John', 4444, 444444, '89869504444', 'john@mail.ru', 'Org4', 35000],
                   [5, 'Sam', 5555, 555555, '89869505555', 'sam@mail.ru', 'Org5', 40000],
                   [6, 'Katy', 6666, 666666, '89869506666', 'katy@mail.ru', None, 0]])

#### 2.2.2. Наименование столбцов датафрейма

In [23]:
#Наименование столбцов датафрейма
df.columns = ['id', 'name', 'passport_series', 'passport_number', 'phone', 'email', 'workplace', 'salary']
#Вывод
df

,id,name,passport_series,passport_number,phone,email,workplace,salary
0,1,Tom,1111,111111,89869501111,tom@mail.ru,Org1,20000
1,2,Bob,2222,222222,89869502222,bob@mail.ru,Org2,25000
2,3,Mike,3333,333333,89869503333,mike@mail.ru,Org3,30000
3,4,John,4444,444444,89869504444,john@mail.ru,Org4,35000
4,5,Sam,5555,555555,89869505555,sam@mail.ru,Org5,40000
5,6,Katy,6666,666666,89869506666,katy@mail.ru,None,0

#### 2.2.3. Получение одного значения из датафрейма с помощью метода .iloc

In [24]:
#Получение одного значения
df.iloc[4, 5]

'sam@mail.ru'

#### 2.2.4. Получение нескольких значений из датафрейма с помощью метода .iloc (срез)

In [25]:
#Получение нескольких значений
df.iloc[2:5, 4]

2    89869503333
3    89869504444
4    89869505555
Name: phone, dtype: object

#### 2.2.5. Получение нескольких значений из датафрейма с помощью метода .iloc (полный срез)

In [26]:
#Полный срез по строкам
df.iloc[:, 1]

0     Tom
1     Bob
2    Mike
3    John
4     Sam
5    Katy
Name: name, dtype: object

In [27]:
#Полный срез по столбцам
df.iloc[2:4, :]

,id,name,passport_series,passport_number,phone,email,workplace,salary
2,3,Mike,3333,333333,89869503333,mike@mail.ru,Org3,30000
3,4,John,4444,444444,89869504444,john@mail.ru,Org4,35000

### 2.3. Индексы и метод .loc

#### 2.3.1. Создание датафрейма

In [28]:
#Импорт
import pandas as pd
#Создание датафрейма
df = pd.DataFrame([[1, 'Tom', 1111, 111111, '89869501111', 'tom@mail.ru', 'Org1', 20000], 
                   [2, 'Bob', 2222, 222222, '89869502222', 'bob@mail.ru', 'Org2', 25000], 
                   [3, 'Mike', 3333, 333333, '89869503333', 'mike@mail.ru', 'Org3', 30000],
                   [4, 'John', 4444, 444444, '89869504444', 'john@mail.ru', 'Org4', 35000],
                   [5, 'Sam', 5555, 555555, '89869505555', 'sam@mail.ru', 'Org5', 40000],
                   [6, 'Katy', 6666, 666666, '89869506666', 'katy@mail.ru', None, 0]])
#Наименование столбцов датафрейма
df.columns = ['id', 'name', 'passport_series', 'passport_number', 'phone', 'email', 'workplace', 'salary']

#### 2.3.2. Выбор одного столбца по названию

In [29]:
#Выбор одного столбца
df['workplace']

0    Org1
1    Org2
2    Org3
3    Org4
4    Org5
5    None
Name: workplace, dtype: object

#### 2.3.3. Выбор нескольких столбцов по названию

In [30]:
#Выбор нескольких столбцов
df[['name', 'email']]

   name         email
0   Tom   tom@mail.ru
1   Bob   bob@mail.ru
2  Mike  mike@mail.ru
3  John  john@mail.ru
4   Sam   sam@mail.ru
5  Katy  katy@mail.ru

#### 2.3.4. Выбор нескольких столбцов с помощью метода .loc (срез)

In [31]:
#Выбор нескольких столбцов (метод .loc)
df.loc[:, 'name':'passport_number']

   name  passport_series  passport_number
0   Tom             1111           111111
1   Bob             2222           222222
2  Mike             3333           333333
3  John             4444           444444
4   Sam             5555           555555
5  Katy             6666           666666

#### 2.3.5. Наименование строк по столбцу

In [32]:
#Наименование
df.index = df.name
#Вывод
df

,id,name,passport_series,passport_number,phone,email,workplace,salary
name,,,,,,,,
Tom,1,Tom,1111,111111,89869501111,tom@mail.ru,Org1,20000
Bob,2,Bob,2222,222222,89869502222,bob@mail.ru,Org2,25000
Mike,3,Mike,3333,333333,89869503333,mike@mail.ru,Org3,30000
John,4,John,4444,444444,89869504444,john@mail.ru,Org4,35000
Sam,5,Sam,5555,555555,89869505555,sam@mail.ru,Org5,40000
Katy,6,Katy,6666,666666,89869506666,katy@mail.ru,None,0

#### 2.3.6. Выбор одной строки по названию с помощью метода .loc

In [33]:
#Выбор одной строки
df.loc['Mike', 'email']

'mike@mail.ru'

#### 2.3.7. Выбор нескольких строк с помощью метода .loc

In [34]:
#Выбор нескольких строк
df.loc['John':'Katy', 'phone']

name
John    89869504444
Sam     89869505555
Katy    89869506666
Name: phone, dtype: object

#### 2.3.8. Выбор нескольких строк и столбцов с помощью метода .loc

In [35]:
#Выбор нескольких строк и столбцов
df.loc['Tom':'Mike', ['email', 'workplace']]

             email workplace
name
Tom    tom@mail.ru      Org1
Bob    bob@mail.ru      Org2
Mike  mike@mail.ru      Org3

### 2.4. Характеристики датафрейма Pandas

#### 2.4.1. Создание датафрейма

In [36]:
#Импорт
import pandas as pd
#Создание датафрейма
df = pd.DataFrame([[1, 'Tom', 1111, 111111, '89869501111', 'tom@mail.ru', 'Org1', 20000], 
                   [2, 'Bob', 2222, 222222, '89869502222', 'bob@mail.ru', 'Org2', 25000], 
                   [3, 'Mike', 3333, 333333, '89869503333', 'mike@mail.ru', 'Org3', 30000],
                   [4, 'John', 4444, 444444, '89869504444', 'john@mail.ru', 'Org4', 35000],
                   [5, 'Sam', 5555, 555555, '89869505555', 'sam@mail.ru', 'Org5', 40000],
                   [6, 'Katy', 6666, 666666, '89869506666', 'katy@mail.ru', None, 0]])
#Наименование столбцов датафрейма
df.columns = ['id', 'name', 'passport_series', 'passport_number', 'phone', 'email', 'workplace', 'salary']

#### 2.4.2. Получение информации о датафрейме

In [37]:
#Информация о датафрейме
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 8 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   id               6 non-null      int64
 1   name             6 non-null      object
 2   passport_series  6 non-null      int64
 3   passport_number  6 non-null      int64
 4   phone            6 non-null      object
 5   email            6 non-null      object
 6   workplace        5 non-null      object
 7   salary           6 non-null      int64
dtypes: int64(4), object(4)
memory usage: 512.0+ bytes

#### 2.4.3. Получение числа строк и столбцов датафрейма

In [38]:
#Число строк и столбцов
df.shape

(6, 8)

In [39]:
#Число строк
df.shape[0]

6

In [40]:
#Число столбцов
df.shape[1]

8

#### 2.4.4. Получение описательных статистик по столбцам датафрейма

In [41]:
#Получение статистик
df.describe()

             id  passport_series  passport_number        salary
count  6.000000         6.000000         6.000000      6.000000
mean   3.500000      3888.500000    388888.500000  25000.000000
std    1.870829      2078.490678    207869.646951  14142.135624
min    1.000000      1111.000000    111111.000000      0.000000
25%    2.250000      2499.750000    249999.750000  21250.000000
50%    3.500000      3888.500000    388888.500000  27500.000000
75%    4.750000      5277.250000    527777.250000  33750.000000
max    6.000000      6666.000000    666666.000000  40000.000000

#### 2.4.5. Вывод названий столбцов датафрейма

In [42]:
#Вывод названий всех столбцов
df.columns

Index(['id', 'name', 'passport_series', 'passport_number', 'phone', 'email',
       'workplace', 'salary'],
      dtype='object')

In [43]:
#Вывод названия одного столбца
df.columns[3]

'passport_number'

#### 2.4.6. Преобразование информации о столбцах в список

In [44]:
#Преобразование в список
list(df.columns)

['id',
 'name',
 'passport_series',
 'passport_number',
 'phone',
 'email',
 'workplace',
 'salary']

#### 2.4.7. Вывод информации о строках датафрейма

In [45]:
#Вывод информации о строках
df.index

RangeIndex(start=0, stop=6, step=1)

### 2.5. Операции над датафреймами (Часть 1)

#### 2.5.1. Создание датафрейма

In [46]:
#Импорт
import pandas as pd
#Создание датафрейма
df = pd.DataFrame([[1, 'Tom', 1111, 111111, '89869501111', 'tom@mail.ru', 'Org1', 20000], 
                   [2, 'Bob', 2222, 222222, '89869502222', 'bob@mail.ru', 'Org2', 25000], 
                   [3, 'Mike', 3333, 333333, '89869503333', 'mike@mail.ru', 'Org3', 30000],
                   [4, 'John', 4444, 444444, '89869504444', 'john@mail.ru', 'Org4', 35000],
                   [5, 'Sam', 5555, 555555, '89869505555', 'sam@mail.ru', 'Org5', 40000],
                   [6, 'Katy', 6666, 666666, '89869506666', 'katy@mail.ru', None, 0]])
#Наименование столбцов датафрейма
df.columns = ['id', 'name', 'passport_series', 'passport_number', 'phone', 'email', 'workplace', 'salary']

#### 2.5.2. Вывод первых нескольких строк датафрейма

In [47]:
#Вывод по умолчанию (первые 5 строк)
df.head()

,id,name,passport_series,passport_number,phone,email,workplace,salary
0,1,Tom,1111,111111,89869501111,tom@mail.ru,Org1,20000
1,2,Bob,2222,222222,89869502222,bob@mail.ru,Org2,25000
2,3,Mike,3333,333333,89869503333,mike@mail.ru,Org3,30000
3,4,John,4444,444444,89869504444,john@mail.ru,Org4,35000
4,5,Sam,5555,555555,89869505555,sam@mail.ru,Org5,40000

In [48]:
#Вывод с параметром (первые 3 строки)
df.head(3)

,id,name,passport_series,passport_number,phone,email,workplace,salary
0,1,Tom,1111,111111,89869501111,tom@mail.ru,Org1,20000
1,2,Bob,2222,222222,89869502222,bob@mail.ru,Org2,25000
2,3,Mike,3333,333333,89869503333,mike@mail.ru,Org3,30000

#### 2.5.3. Вывод последних несскольких строк датафрейма

In [49]:
#Вывод по умолчанию (последние 5 строк)
df.tail()

,id,name,passport_series,passport_number,phone,email,workplace,salary
1,2,Bob,2222,222222,89869502222,bob@mail.ru,Org2,25000
2,3,Mike,3333,333333,89869503333,mike@mail.ru,Org3,30000
3,4,John,4444,444444,89869504444,john@mail.ru,Org4,35000
4,5,Sam,5555,555555,89869505555,sam@mail.ru,Org5,40000
5,6,Katy,6666,666666,89869506666,katy@mail.ru,None,0

#### 2.5.4. Удаление строк с пропущенными значениями (NaN)

In [50]:
#Удаление строк с NaN
df = df.dropna()
#Вывод
df

,id,name,passport_series,passport_number,phone,email,workplace,salary
0,1,Tom,1111,111111,89869501111,tom@mail.ru,Org1,20000
1,2,Bob,2222,222222,89869502222,bob@mail.ru,Org2,25000
2,3,Mike,3333,333333,89869503333,mike@mail.ru,Org3,30000
3,4,John,4444,444444,89869504444,john@mail.ru,Org4,35000
4,5,Sam,5555,555555,89869505555,sam@mail.ru,Org5,40000

#### 2.5.5. Выбор строк по условию

In [51]:
#Одно условие
df[df['salary'] >= 30000]

,id,name,passport_series,passport_number,phone,email,workplace,salary
2,3,Mike,3333,333333,89869503333,mike@mail.ru,Org3,30000
3,4,John,4444,444444,89869504444,john@mail.ru,Org4,35000
4,5,Sam,5555,555555,89869505555,sam@mail.ru,Org5,40000

#### 2.5.6. Выбор строк по нескольким условиям (операция &)

In [52]:
#Несколько условий (операция &)
df[(df['salary'] > 20000) & (df['salary'] < 40000)]

,id,name,passport_series,passport_number,phone,email,workplace,salary
1,2,Bob,2222,222222,89869502222,bob@mail.ru,Org2,25000
2,3,Mike,3333,333333,89869503333,mike@mail.ru,Org3,30000
3,4,John,4444,444444,89869504444,john@mail.ru,Org4,35000

#### 2.5.7. Выбор строк по нескольким условиям (операция |)

In [53]:
#Несколько условий (операция |)
df[(df['workplace'] == 'Org1') | (df['workplace'] == 'Org5')]

,id,name,passport_series,passport_number,phone,email,workplace,salary
0,1,Tom,1111,111111,89869501111,tom@mail.ru,Org1,20000
4,5,Sam,5555,555555,89869505555,sam@mail.ru,Org5,40000

### 2.6. Операции над датафреймами (Часть 2)

#### 2.6.1. Создание датафрейма

In [54]:
#Импорт
import pandas as pd
#Создание датафрейма
df = pd.DataFrame([[1, 'Tom', 1111, 111111, '89869501111', 'tom@mail.ru', 'Org1', 20000], 
                   [2, 'Bob', 2222, 222222, '89869502222', 'bob@mail.ru', 'Org2', 25000], 
                   [3, 'Mike', 3333, 333333, '89869503333', 'mike@mail.ru', 'Org3', 30000],
                   [4, 'John', 4444, 444444, '89869504444', 'john@mail.ru', 'Org4', 35000],
                   [5, 'Sam', 5555, 555555, '89869505555', 'sam@mail.ru', 'Org5', 40000],
                   [6, 'Katy', 6666, 666666, '89869506666', 'katy@mail.ru', None, 0]])
#Наименование столбцов датафрейма
df.columns = ['id', 'name', 'passport_series', 'passport_number', 'phone', 'email', 'workplace', 'salary']

#### 2.6.2. Создание нового столбца по значениям из старых столбцов

In [55]:
#Создание столбца
df['salary_after_tax'] = df['salary'] * 0.87
#Вывод
df

,id,name,passport_series,passport_number,phone,email,workplace,salary,salary_after_tax
0,1,Tom,1111,111111,89869501111,tom@mail.ru,Org1,20000,17400.0
1,2,Bob,2222,222222,89869502222,bob@mail.ru,Org2,25000,21750.0
2,3,Mike,3333,333333,89869503333,mike@mail.ru,Org3,30000,26100.0
3,4,John,4444,444444,89869504444,john@mail.ru,Org4,35000,30450.0
4,5,Sam,5555,555555,89869505555,sam@mail.ru,Org5,40000,34800.0
5,6,Katy,6666,666666,89869506666,katy@mail.ru,None,0,0.0

#### 2.6.3. Создание нового столбца из одного значения

In [56]:
#Столбец из одного значения
df['bank_status'] = 'client'
#Вывод
df

,id,name,passport_series,passport_number,phone,email,workplace,salary,salary_after_tax,bank_status
0,1,Tom,1111,111111,89869501111,tom@mail.ru,Org1,20000,17400.0,client
1,2,Bob,2222,222222,89869502222,bob@mail.ru,Org2,25000,21750.0,client
2,3,Mike,3333,333333,89869503333,mike@mail.ru,Org3,30000,26100.0,client
3,4,John,4444,444444,89869504444,john@mail.ru,Org4,35000,30450.0,client
4,5,Sam,5555,555555,89869505555,sam@mail.ru,Org5,40000,34800.0,client
5,6,Katy,6666,666666,89869506666,katy@mail.ru,None,0,0.0,client

#### 2.6.4. Создание нового столбца из списка значений

In [57]:
#Столбец из списка значений
df['gender'] = [1, 1, 1, 1, 1, 0]
#Вывод
df

,id,name,passport_series,passport_number,phone,email,workplace,salary,salary_after_tax,bank_status,gender
0,1,Tom,1111,111111,89869501111,tom@mail.ru,Org1,20000,17400.0,client,1
1,2,Bob,2222,222222,89869502222,bob@mail.ru,Org2,25000,21750.0,client,1
2,3,Mike,3333,333333,89869503333,mike@mail.ru,Org3,30000,26100.0,client,1
3,4,John,4444,444444,89869504444,john@mail.ru,Org4,35000,30450.0,client,1
4,5,Sam,5555,555555,89869505555,sam@mail.ru,Org5,40000,34800.0,client,1
5,6,Katy,6666,666666,89869506666,katy@mail.ru,None,0,0.0,client,0